{
    "DistanceUnint.Cm|block": "Cm",
    "DistanceUnint.Inch|block": "Zoll",
    "MotorContinuationMode.Wait|block": "Warten",
    "MotorContinuationMode.Continue|block": "Fortfahren",
    "MotorMovementMode.Turns|block": "Umdrehungen",
    "MotorMovementMode.Degrees|block": "Grad",
    "MotorMovementMode.Seconds|block": "Sekunden",
    "MotorRotationDirection.CW|block": "Uhrzeigersinn",
    "MotorRotationDirection.CCW|block": "Gegen Uhrzeigersinn",
    "ServoMovementMode.ShortPath|block": "Kürzester Weg",
    "ServoMovementMode.CW|block": "Uhrzeigersinn",
    "ServoMovementMode.CCW|block": "Gegen Uhrzeigersinn",
    "LinearDirection.Forward|block": "Vorwärts",
    "LinearDirection.Backward|block": "Rückwärts",
    "TurnDirection.Left|block": "Links",
    "TurnDirection.Right|block": "Rechts",
    "ms_nezhaV2.runMotor": "Lässt den ausgewählten Motor mit einer bestimmten Geschwindigkeit laufen.",
    "ms_nezhaV2.runMotor|block": "Starte Motor %motor Geschwindigkeit %speed",
    "ms_nezhaV2.runMotorFor": "Lässt den ausgewählten Motor mit einer bestimmten Geschwindigkeit für eine bestimmte Anzahl von Umdrehungen, Grad oder Sekunden laufen. Durch Erweitern des Blocks kann der Benutzer auch angeben, ob der Code warten soll, bis die Bewegung abgeschlossen ist (Ja) oder ob der Code sofort weiter ausgeführt werden soll (Nein). Standardmäßig (wenn der Block nicht erweitert wird) wird der Code warten, bis die Bewegung abgeschlossen ist.",
    "ms_nezhaV2.runMotorFor|block": "Drehe Motor %motor Geschwindigkeit %speed für %value %mode || warte bis fertig %wait",
    "ms_nezhaV2.readServoAbsoluteSpeed": "Die aktuelle Drehzahl des ausgewählten Motors in Umdrehungen pro Minute (U/min).",
    "ms_nezhaV2.readServoAbsoluteSpeed|block": "%motor Geschwindigkit (rpm)",
    "ms_nezhaV2.freeMotor": "Beendet das elektrische halten des motors an der momentanen Position. Nach Ausführung dieser Funktion kann der Motor wieder händisch bewegt werden (nicht empfohlen!).",
    "ms_nezhaV2.freeMotor|block": "Gehaltenen Motor %motor lösen.",
    "ms_nezhaV2.holdMotor": "Den ausgewählten Motor an der momentanen Position elektrisch halten.",
    "ms_nezhaV2.holdMotor|block": "Motor %motor auf Position halten.",
    "ms_nezhaV2.stopMotor": "Stoppt den ausgewählten Motor.",
    "ms_nezhaV2.stopMotor|block": "Stoppe Motor %motor",
    "ms_nezhaV2.stopAllMotor": "Stoppt alle Motoren.",
    "ms_nezhaV2.stopAllMotor|block": "Stoppe alle Motoren",
    "ms_nezhaV2.setEncoderPositionOffset": "Setzt die aktuelle Winkelposition des ausgewählten Motors als 0-Position für alle weiteren Bewegungen.",
    "ms_nezhaV2.setEncoderPositionOffset|block": "Aktuelle Position von Motor %motor auf Position 0 für diesen Motor setzen.",
    "ms_nezhaV2.goToAbsolutePositionFromCode": "Bewegt den ausgewählten Motor mit der ausgewählten Geschwindigkeit zum ausgewählten Winkel (im Bereich von 0 bis 359). Die gewünschte Drehung kann im Uhrzeigersinn, gegen den Uhrzeigersinn oder auf dem schnellsten Weg gewählt werden. Die 0-Winkel-Position des Motors ist die Position, in der sich der Motor beim Einschalten des Nezha V2 Blocks oder beim Anschließen des Motors befindet.  Die 0-Position kann mit dem entsprechenden Block geändert werden.",
    "ms_nezhaV2.goToAbsolutePositionFromCode|block": "Drehe Motor %motor mit Geschwindigkeit %speed zu Position %angle° Richtung %turnmode",
    "ms_nezhaV2.readServoAbsolutePosition": "Der Winkel, in dem sich der Motor gerade befindet (Bereich 0 bis 359). Die 0-Winkelposition des Motors ist die Position, in der sich der Motor befindet, wenn der Nezha V2 Block eingeschaltet wird oder der Motor angeschlossen wird. Die 0-Position kann mit dem entsprechenden Block geändert werden.",
    "ms_nezhaV2.readServoAbsolutePosition|block": "%motor Winkelposition (0 to 359)",
    "ms_nezhaV2.readServoAbsolutePositionAggregate": "Liest die laufende Summe der Grad, um die sich der Motor seit dem Start gedreht hat. Der Wert ist zunächst 0, wenn der Nezha V2 Block eingeschaltet wird oder wenn der Motor angeschlossen wird.  Die 0-Position kann auch mit dem entsprechenden Block geändert werden. Danach wird dieser Wert bei jeder Vorwärts- oder Rückwärtsbewegung inkrementiert oder dekrementiert. Dies kann verwendet werden, um auf einfache Weise eine Differenz in Grad von einem Zeitpunkt zu einem anderen zu berechnen.",
    "ms_nezhaV2.readServoAbsolutePositionAggregate|block": "%motor summierte Winkelposition",
    "ms_nezhaV2.setupTankModeRobot": "Beim Panzerantrieb handelt es sich um eine Roboterkonfiguration, bei der der Antrieb und die Lenkung durch die Änderung der Geschwindigkeit von zwei parallel montierten Motoren erfolgt. Typischerweise gibt es bei dieser Konstruktion ein zusätzliches Laufrad, das sich in alle Richtungen frei bewegen kann. *** Um die Blöcke in diesem Abschnitt zu verwenden, müssen die folgenden Parameter eingestellt werden: * Rechter und linker Antriebsmotor * Der Raddurchmesser des Roboters * Der Radstand des Roboters. *** Je nachdem, wie ein Motor am Roboterkörper befestigt ist, kann es notwendig sein, den Motor umzudrehen, um sicherzustellen, dass der Motor in der richtigen Richtung arbeitet. *** Der Raddurchmesser wird verwendet, um zu berechnen, wie weit sich ein Roboterrad bewegt hat. *** Der Radstand wird verwendet, um die erforderlichen Abstände zu berechnen, die jedes Rad für eine Drehung zurücklegen muss. Wenn Sie feststellen, dass der Punktwendeblock nicht genau ist, passen Sie diesen Wert zur Feinabstimmung an. *** Der Raddurchmesser und der Radstandabstand können in cm oder Zoll eingegeben werden, indem Sie die gewünschte Einheit auswählen.",   
    "ms_nezhaV2.setupTankModeRobot|block": "Roboter konfigurieren:|Rechter Fahrmotor ist %motorR|Rechten Fahrmotor umdrehen %reverseR|Linker Fahrmotor ist %motorL|Linken Fahrmotor umdrehen %reverseL|Reifendurchmesser ist %wheelDiameter|Radstand ist %wheelbase|Einheit: %unit",
    "ms_nezhaV2.stopTank": "Stoppt die Bewegung des roboters.",
    "ms_nezhaV2.stopTank|block": "Bewegung stoppen",
    "ms_nezhaV2.driveTank": "Startet die Vorwärts- oder Rückwärtsfahrt des Roboters mit der eingestellten Geschwindigkeit.",
    "ms_nezhaV2.driveTank|block": "Fahre %direction Geschwindigkeit %speed",
    "ms_nezhaV2.driveTankFor": "Fährt den Roboter mit der eingestellten Geschwindigkeit für die eingestellte Anzahl von Radumdrehungen, Radgrad oder Sekunden vorwärts oder rückwärts.",
    "ms_nezhaV2.driveTankFor|block": "Fahre %direction Geschwindigkeit %speed für %value %mode",
    "ms_nezhaV2.driveTankForDistance": "Fährt den Roboter mit der eingestellten Geschwindigkeit um die eingestellte Anzahl von Zentimetern oder Zoll vorwärts oder rückwärts. Der Raddurchmesser muss eingestellt werden, bevor dieser Block verwendet wird.",
    "ms_nezhaV2.driveTankForDistance|block": "Fahre %direction Geschwindigkeit %speed für %distance %unit",
    "ms_nezhaV2.spotTurnTankForDegrees": "Dreht den Roboter auf der Stelle um die eingestellte Anzahl von Grad nach links oder rechts. Der Radstandsabstand muss eingestellt werden, bevor dieser Block verwendet wird. Der Radstandabstand wird zur Berechnung der Punktdrehung verwendet. Wenn Sie feststellen, dass die Punktdrehung nicht genau ist, passen Sie den Radstand zur Feinabstimmung an.",
    "ms_nezhaV2.spotTurnTankForDegrees|block": "Punktwende %direction Geschwindigkeit %speed für %degrees Grad",
    "ms_nezhaV2.driveTankDualSpeedForSeconds": "Treibt den Roboter mit unabhängigen Geschwindigkeiten für jeden Motor an. Optional für die eingestellte Anzahl von Sekunden. Durch die Einstellung verschiedener Geschwindigkeiten kann der Roboter Drehungen mit unterschiedlichen Radien ausführen.",
    "ms_nezhaV2.driveTankDualSpeedForSeconds|block": "Fahre linker Motor %speedLeft\\% rechter Motor %speedRight\\% || für %seconds Sekunden",
    "ms_nezhaV2.driveTankForwardLeft": "Fährt den Roboter vorwärts und links.",
    "ms_nezhaV2.driveTankForwardLeft|block": "Vorwärts und links mit Geschwindigkeit %speed",
    "ms_nezhaV2.driveTankForwardRight": "Fährt den Roboter vorwärts und rechts.",
    "ms_nezhaV2.driveTankForwardRight|block": "Vorwärts und rechts mit Geschwindigkeit %speed",
    "ms_nezhaV2.readVersion": "Liest die aktuelle Firmware-Version des angeschlossenen Nezha-V2-Blocks aus. Stellen Sie sicher, dass der Nezha-Block vollständig initialisiert ist, bevor Sie diesen Block verwenden.",
    "ms_nezhaV2.readVersion|block": "NezhaV2 Block Firmware Version",
    "{id:subcategory}Motor / Servo": "Motor / Servo",
    "{id:subcategory}Robot Tank Drive": "Roboter Fahren",
    "{id:group}Motor Functions": "Motor Funktionen",
    "{id:group}Servo Functions": "Servo Funktionen",
    "{id:group}Setup": "Setup",
    "{id:group}Movement": "Bewegen",
    "{id:group}Advanced": "Fortgeschrittene Funktionen"
}
